
{
    "code": 200,
    "article_title": "Coronavírus: o que se sabe até agora?",
    "article_description": "Precauções podem evitar a infecção",
    "article_image": "https://ogimg.infoglobo.com.br/in/24204630-58b-80c/FT1086A/652/TOPSHOT-CHINA-HEALTH-VIRUS-GB54FGA6O.1.jpg",
    "article_capitalize": "R",
    "article_body": [
      {
        "content": "IO — Em dezembro do ano passado, uma pneumonia de causa desconhecida começou a se espalhar por Wuhan, megalópole da região central da China. Desde então, a doença misteriosa fez 106 vítimas no país e infectou 4.515 pessoas no país, segundo dados oficiais, difundindo-se depois para outras nações asiáticas, além de EUA, Austrália e França.",
        "is_img": false
      },
      {
        "content": "Mais de 50 milhões de chineses estão isolados em suas cidades, depois da imposição de restrições às redes de transporte em outras quatro localidades. Ao todo, dez prefeituras adotaram medidas de confinamento na região de Wuhan (centro), a metrópole de 11 milhões de habitantes, onde o vírus foi detectado.",
        "is_img": false
      },
      {
        "content": "O governo chinês também anunciou o fechamento de trechos da Grande Muralha, assim como de monumentos emblemáticos de Pequim, em meio às medidas adotadas para controlar a propagação do coronavírus.",
        "is_img": false
      },
      {
        "content": "Veja também: OMS diz que 'não é hora' de declarar o coronavírus como emergência global",
        "is_img": false
      },
      {
        "content": "Além da China, já foram confirmados casos de coronavírus nos países — Alemanha, Austrália, Canadá, Cingapura, Coreia do Sul, EUA, França, Japão, Nepal, Tailândia, Malásia e Vietnã —, além de Hong Kong, Taiwan e Macau.",
        "is_img": false
      },
      {
        "content": "O Ocidente também observa o número de casos com apreensão. Os três primeiros episódios foram confirmados na França.",
        "is_img": false
      },
      {
        "content": "O diretor médico emérito da Public Health England, agência do Departamento de Saúde e Assistência Social do governo britânico, disse ser \"altamente provável\" que casos do coronavírus já tenham surgido no Reino Unido.",
        "is_img": false
      },
      {
        "content": "O porta-voz do premier Boris Johnson anunciou a convocação de um encontro entre lideranças do governo para planejar uma resposta emergencial à possível chegada do vírus no país.",
        "is_img": false
      },
      {
        "content": "Um painel da Organização Mundial de Saúde (OMS) anunciou que \"ainda não é hora\" declarar o coronavírus como emergência global. Os especialistas ainda têm dúvidas sobre como ocorre o contágio dos animais para o ser humano e, depois, entre humanos.",
        "is_img": false
      },
      {
        "content": "Confira algumas perguntas e respostas sobre o coronavírus.",
        "is_img": false
      },
      {
        "content": "O que é o coronavírus?",
        "is_img": false
      },
      {
        "content": "Nomeado a partir de sua forma circular, o coronavírus (CoV) é uma ampla família de vírus à qual pertencem as cepas que causaram, por exemplo, a Sars e a Mers. Já se sabe que a pneumonia misteriosa é causada por uma nova cepa que os cientistas ainda não conheciam, identificado como 2019-nCoV.",
        "is_img": false
      },
      {
        "content": "Via de regra, os sintomas de um coronavírus são nariz entupido, tosse, garganta inflamada, mal estar, febre e dor de cabeça. Segundo o Centro de Controle e Prevenção de Doenças dos Estados Unidos, a maior parte das pessoas contrai algum tipo de coronavírus durante a vida, e tende a se curar em poucos dias.",
        "is_img": false
      },
      {
        "content": "",
        "is_img": false
      },
      {
        "content": " Mas algumas variantes do coronavírus podem afetar gravemente o sistema respiratório, causando pneumonia, sobretudo em indivíduos muito novos ou muito velhos, em portadores de doenças cardiopulmonares ou em pessoas com sistema imunológico debilitado. Tudo indica que este é o caso do coronavírus 2019-nCoV.",
        "is_img": false
      },
      {
        "content": "Sete dos tipos conhecidos de coronavírus podem infectar pessoas — o 2019-nCoV é um deles. Outro exemplo da categoria foi a Sars, que matou 774 pessoas e infectou pouco mais de 8 mil, em uma epidemia que começou na China em 2002.",
        "is_img": false
      },
      {
        "content": "Para Edimilson Migowski, professor de infectologia da Universidade Federal do Rio de Janeiro (UFRJ), o novo coronavírus tem se mostrado \"muito agressivo e virulento, mas por outro lado é bom porque ao matar (o vírus) se dissemina menos\".",
        "is_img": false
      },
      {
        "content": "— Quando é assim, o paciente rapidamente é internado, fazendo com que o impacto de disseminação seja menor do que uma infeção comum — explica.",
        "is_img": false
      },
      {
        "content": "Como acontece a transmissão?",
        "is_img": false
      },
      {
        "content": "O coronavírus, em geral, é transmitido pelo ar, por meio de grandes gotículas expelidas na respiração, ou por contato direto ou indireto com secreções. Como o 2019-nCoV foi descoberto recentemente, é impossível detalhar sua rota de transmissão.",
        "is_img": false
      },
      {
        "content": " — É um vírus que se mantem viável no ambiente em superfícies molhadas por dias. Uma pessoa pode se contaminar por contato respiratório, utensílios contaminados. Transmissão por via aérea é sempre preocupante. Mas o vírus não vai pular da maçaneta para sua boca, por isso é importante redobrar cuidados com as mãos. Água e sabão resolvem.",
        "is_img": false
      },
      {
        "content": "Sabe-se que o coronavírus costuma ser contraído por seres humanos pelo contato com outras espécies. A Sars, por exemplo, veio da civeta (ou gato-de-agália, espécie aparentada do guaxinim), animal então consumido na China como iguaria.",
        "is_img": false
      },
      {
        "content": "A Mers, que dizimou 858 dos 2.494 pacientes diagnosticados desde 2012, veio dos dromedários, que chegaram a ser cogitados como possíveis transmissores do vírus para os seres humanos, embora nada tenha sido confirmado até agora.",
        "is_img": false
      },
      {
        "content": "Um mercado de frutos do mar em Wuhan está no centro das suspeitas sobre a origem da doença. Embora alguns animais marinhos possam hospedar o vírus, é mais provável que ele tenha vindo de algum animal comercializado vivo, como galinha, cobra, morcego, cobra ou coelho.",
        "is_img": false
      },
      {
        "content": "Quais as chances de o vírus chegar ao Brasil?",
        "is_img": false
      },
      {
        "content": "O Ministério da Saúde não registrou nenhum caso de 2019-nCoV no Brasil até agora. O governo federal  instalou um Centro de Operações de Emergência (COE) para tratar do surto.",
        "is_img": false
      },
      {
        "content": "Ainda não se sabe dimenisonar a facilidade de contágio do vírus. No entanto, a maior parte das transmissões foi registrada nas últimas horas.",
        "is_img": false
      },
      {
        "content": "O que fazer se você voltou da China recentemente?",
        "is_img": false
      },
      {
        "content": "Se você tiver febre, tosse ou dificuldade para respirar, dentro de um período de até 14 dias, após viagem para a China, você deve procurar a unidade de saúde mais próxima e informar a respeito da sua viagem. ",
        "is_img": false
      },
      {
        "content": "Como prevenir o coronavírus?",
        "is_img": false
      },
      {
        "content": "Até agora, as formas mais letais dos coronavírus não têm vacina nem cura. No entanto, ações básicas podem prevenir qualquer infecção contagiosa que possa ser transmitida pelo ar ou pelo contato.",
        "is_img": false
      },
      {
        "content": "Segundo o portal do Ministério da Saúde, são recomendáveis: \"frequente lavagem e higienização das mãos, principalmente antes de consumir algum alimento; utilizar lenço descartável para higiene nasal; cobrir nariz e boca quando espirrar ou tossir; evitar tocar mucosas de olhos, nariz e boca; higienizar as mãos após tossir ou espirrar; não compartilhar objetos de uso pessoal, como talheres, pratos, copos ou garrafas; manter os ambientes bem ventilados; e evitar contato próximo a pessoas que apresentem sinais ou sintomas de infecção respiratória\".",
        "is_img": false
      },
      {
        "content": "— O que as pessoas sempre podem fazer é redobrar o cuidado com higiene das mãos. Estudos mostram que o brasileiro toma muito banho, mas lava pouco as mãos. Em 2009, na ocasião da gripe suína, antes mesmo de a doença chegar ao Brasil, houve alarme grande para manter higiene das mãos. E naquele ano os laboratórios que vendiam produtos para diarreia, gripe e outras doenças não bateram as metas porque houve intensificação da higiene das mãos — informa Edimilson Migowski.",
        "is_img": false
      },
      {
        "content": "*Estagiário sob supervisão de Eduardo Graça",
        "is_img": false
      }
    ],
    "site_name": "O Globo",
    "site_favicon": "https://oglobo.globo.com/apple-touch-icon.png",
    "keywords": [
      "Saúde",
      "pneumonia",
      "desconhecida",
      "Wuhan",
      "China",
      "doenca misteriosa",
      "Sars",
      "Oriente Medio",
      "Taiwan",
      "Hong Kong",
      "Tailandia",
      "Japao",
      "Coreia do Sul",
      "Estados Unidos",
      "Mexico",
      "Australia",
      "Reino Unido",
      "Organizacao Mundial de Saude",
      "OMS",
      "coronavirus",
      "2019-nCoV",
      "epidemia",
      "Ministerio da Saude",
      "contagio",
      "Brasil"
    ],
    "original_post": "https://oglobo.globo.com/sociedade/saude/coronavirus-que-se-sabe-ate-agora-24204619"
  }
