
{
  "code": 200,
  "article_title": "ONU: 2019 foi o segundo ano mais quente da história",
  "article_description": "Números da Organização Meteorológica Mundial, braço das Nações Unidas para o clima, coincidem com estudo da UE",
  "article_image": "https://ogimg.infoglobo.com.br/in/24191372-0f0-6d4/FT1086A/652/86390947_TOPSHOTA-long-exposure-picture-shows-a-car-commuting-on-a-road-as-the-sky-turns-red-from.jpg",
  "article_capitalize": "G",
  "article_body": [
    {
      "content": "ENEBRA — O ano passado foi o segundo mais quente desde o início dos registros, informou a Organização Meteorológica Mundial (OMM) nesta quarta-feira. A entidade, o braço das Nações Unidas para o clima, alertou que o calor provavelmente levará a eventos climáticos mais extremos, como os incêndios florestais australianos registrados desde setembro de 2019. ",
      "is_img": false
    },
    {
      "content": "A série histórica começou a ser registrada em 1850. Os dados da OMM, com sede em Genebra, analisam vários conjuntos de dados, incluindo a Nasa e o serviço nacional de meteorologia do Reino Unido. O estudo mostrou que a temperatura global média em 2019 estava 1,1 grau Celsius acima dos níveis pré-industriais.",
      "is_img": false
    },
    {
      "content": "Leia também: Caos no clima revela a sua face em todo o planeta em 2019",
      "is_img": false
    },
    {
      "content": "— A Austrália teve o ano mais quente e seco já registrado em 2019, estabelecendo o cenário para os enormes incêndios florestais que foram tão devastadores para pessoas e propriedades, vida selvagem, ecossistemas e meio ambiente — disse o secretário-geral da OMM, Petteri Taalas.",
      "is_img": false
    },
    {
      "content": "Veja mais: Entenda os quatro relatórios da ONU que dão a dimensão da emergência climática",
      "is_img": false
    },
    {
      "content": "\"Infelizmente, esperamos ver muito clima extremo ao longo de 2020 e nas próximas décadas, alimentado por níveis recordes de gases de efeito estufa que retêm o calor na atmosfera.\"",
      "is_img": false
    },
    {
      "content": "O ano mais quente já registrado foi em 2016, disse a OMM, devido ao impacto do aquecimento de um forte evento de El Niño. Desde 1980, cada década tem se tornado mais quente do que a anterior. O período entre 2010 e 2019 foi o mais quente da história. Os números batem com os apresentados pelo Serviço de Mudanças Climáticas Copernicus (C3S), da União Europeia (UE), na semana passada. ",
      "is_img": false
    },
    {
      "content": "\nOs comentários são de responsabilidade exclusiva de seus autores e não\nrepresentam a opinião deste site. Se achar algo que viole os termos de\nuso, denuncie. Leia as perguntas mais frequentes para saber o que é\nimpróprio ou ilegal\n",
      "is_img": false
    }
  ],
  "site_name": "O Globo",
  "site_favicon": "https://oglobo.globo.com/apple-touch-icon.png",
  "keywords": [
    "Sustentabilidade"
  ],
  "original_post": "https://oglobo.globo.com/sociedade/sustentabilidade/onu-2019-foi-segundo-ano-mais-quente-da-historia-24191350"
}